
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ПроверитьУникальностьИдентификатора(Отказ);	
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Процедура ПроверитьУникальностьИдентификатора(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПодключения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вз_НастройкиПодключения КАК НастройкиПодключения
		|ГДЕ
		|	НастройкиПодключения.Ссылка <> &Ссылка
		|	И НастройкиПодключения.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ТекстСообщения = СтрШаблон(
		"ru='Идентификатор %1 уже используется в настройке %2'",
		Идентификатор,
		Выборка.Ссылка);
		
	ОбщегоНазначения.СообщитьПользователю(НСтр(ТекстСообщения), Выборка.Ссылка, , , Отказ);
		
КонецПроцедуры

#КонецОбласти