///////////////////////////////////////////////////////////////////////////////////////////////////////
// Внешние запросы.
// Светлаков А. В., 09.02.2023
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает имя элемента перечисления по его значению, взято из БСП
//
// Параметры:
//  ЗначениеПеречисления - Перечисление	 - Значение объекта перечисления базы данных, 
//										   например "Перечисления.ТипыДоговоров.СПокупателем"
// 
// Возвращаемое значение:
//   - Строка - Имя элемента, например "СПокупателем"
//
Функция ПолучитьИмяЭлементаПеречисленияПоЗначению(ЗначениеПеречисления) Экспорт
	
	ИмяЭлемента = Строка(ЗначениеПеречисления);
	Значения = Метаданные.Перечисления[ЗначениеПеречисления.Метаданные().Имя];
	Для каждого ЭлементПеречисления Из Значения.ЗначенияПеречисления Цикл
		Если ЭлементПеречисления.Синоним = Строка(ЗначениеПеречисления) Тогда
			ИмяЭлемента = ЭлементПеречисления.Имя;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ИмяЭлемента;
	
КонецФункции

// Возвращает строковое представление типа значения
//
// Параметры:
//  ТипЗначения	 - Тип	 - Тип значения
// 
// Возвращаемое значение:
//   - Строка - Представление типа
//
Функция ПолучитьПредставлениеТипа(ТипЗначения) Экспорт

	Мета = Метаданные.НайтиПоТипу(ТипЗначения);
	
	Если Мета = Неопределено Тогда
		Возврат Строка(ТипЗначения);	
	КонецЕсли;
	
	Возврат Мета.ПолноеИмя();
	
КонецФункции

#КонецОбласти
